Revit 2027 API
CompoundStructure.GetCoreBoundaryLayerIndex Method
 Returns the index of the layer just below the core boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetCoreBoundaryLayerIndex(
	ShellLayerType shellLayerType
)
Public Function GetCoreBoundaryLayerIndex (
	shellLayerType As ShellLayerType
) As Integer
public:
int GetCoreBoundaryLayerIndex(
	ShellLayerType shellLayerType
)
member GetCoreBoundaryLayerIndex :
        shellLayerType : ShellLayerType -> int
Parameters
shellLayerType ShellLayerType
 If ShellLayerType.Exterior return the index on the exterior side (or top side for a roof, floor, or ceiling type). If ShellLayerType.Interior return the index on the interior side (or bottom side for a roof, floor, or ceiling type).
Return Value
Int32
 The index of the layer.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 -1 returned if there is no such a layer. You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace